prompt = """
Контекст: В протерозойских отложениях органические остатки встречаются намного чаще, чем в архейских. Они представлены известковыми выделениями сине-зелёных водорослей, ходами червей, остатками кишечнополостных. Кроме известковых водорослей, к числу древнейших растительных остатков относятся скопления графито-углистого вещества, образовавшегося в результате разложения Corycium enigmaticum. В кремнистых сланцах железорудной формации Канады найдены нитевидные водоросли, грибные нити и формы, близкие современным кокколитофоридам. В железистых кварцитах Северной Америки и Сибири обнаружены железистые продукты жизнедеятельности бактерий.
Вопрос: чем представлены органические остатки?
Ответ: известковыми выделениями сине-зелёных водорослей

Контекст: Город Байконур и космодром Байконур вместе образуют комплекс Байконур , арендованный Россией у Казахстана на период до 2050 года. Эксплуатация космодрома стоит около 9 млрд рублей в год (стоимость аренды комплекса Байконур составляет 115 млн долларов — около 7,4 млрд рублей в год; ещё около 1,5 млрд рублей в год Россия тратит на поддержание объектов космодрома), что составляет 4,2 % от общего бюджета Роскосмоса на 2012 год. Кроме того, из федерального бюджета России в бюджет города Байконура ежегодно осуществляется безвозмездное поступление в размере 1,16 млрд рублей (по состоянию на 2012 год). В общей сложности космодром и город обходятся бюджету России в 10,16 млрд рублей в год.
Вопрос: У кого Россия арендует космодром
Ответ: у Казахстана

Контекст: После саммита Большой двадцатки в Лондоне в апреле 2009 года ситуация несколько успокоилась. Швейцария переняла стандарты ОЭСР в сфере оказания правовой помощи в делах, связанных с налоговыми преступлениями. Однако, Министерство юстиции США продолжает настаивать на своих претензиях к банку UBS, поддерживая IRS в её требовании предоставить-таки налоговым властям США данные сразу о 52 тыс. счетов американцев. Суд в Майами, который занимается этим делом, уже отклонил аргументацию Швейцарии и банка, указывая, что дело это полностью соответствует праву США, которое предоставляет право получать информацию из-за рубежа, так что данного рода требования к UBS не суть новая правовая концепция . Банк должен нести ответственность за свои деяния , — считает суд.
Вопрос: На претензиях к какой организации продолжает настаивать Министерство юстиции США?
Ответ: к банку UBS

Контекст: Существование абсолютных преимуществ, когда данная страна может осуществлять производстве определенного товара с меньшими издержками, то есть используя меньшее количество ресурсов, чем её потенциальные внешнеторговые партнеры, лежит в основе международного разделения труда. Именно на производстве таких товаров и следует специализироваться, продавая их излишки по каналам международной торговли в обмен на продукцию, выпуск которой в стране не осуществляется. В результате такого обмена товарами между государствами каждое из них оказывается в выигрыше, либо получая в свое распоряже­ние те товары, которые оно само в принципе не в состоянии производить, либо приобретая зарубеж­ную продукцию по ценам значительно ниже тех, которые могут обеспечить отечественные произво­дители. Иными словами, международная торговля превращается в деятельность, приносящую выгоду всем участникам.
Вопрос: Что происходит в государствах, которые обменивают товары, произведенные с меньшими издержками, друг с другом?
Ответ: каждое из них оказывается в выигрыше

Контекст: {context}
Вопрос: {question}
Ответ: 
"""